[
  {
    "image": "https://play-lh.googleusercontent.com/r9zF77jorOmkaRlXnvsLiuVQ3p_gYW8y7x_UL-COoH9PxaTUEMbW1wiwS0z1n1Q31Q",
    "title": "Adobe Photoshop Express",
    "companyName": "Adobe Inc.",
    "id": 1,
    "description": "Adobe Photoshop Express is a comprehensive mobile photo editing application that brings professional-grade editing tools to your fingertips. This powerful app offers an extensive suite of features including advanced color correction, precise cropping and straightening, automatic perspective correction, and sophisticated noise reduction technology. Users can leverage dozens of creative filters and effects, apply custom borders and textures, and utilize the powerful healing brush to remove unwanted objects seamlessly. \n\nThe app supports raw file editing, provides cloud storage integration with Adobe Creative Cloud, and enables batch processing for efficient workflow. With its intuitive user interface designed for both beginners and professionals, Photoshop Express ensures your photos look stunning across social media platforms, print materials, and digital presentations while maintaining the highest quality standards.",
    "size": 185,
    "reviews": 45280,
    "ratingAvg": 4.6,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 1250 },
      { "name": "2 star", "count": 2150 },
      { "name": "3 star", "count": 5890 },
      { "name": "4 star", "count": 12540 },
      { "name": "5 star", "count": 23450 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/7ghCqs4kKYrQpTECddnejlSeAXgpdiiKlIghuDR869MpF5msXdPsd3gqjC6lstD_NfJkmP0LAUJTty7UACcrLw=w240-h480-rw",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify AB",
    "id": 2,
    "description": "Spotify revolutionizes your audio experience by providing instant access to over 80 million songs, 4 million podcast titles, and countless audiobooks in a single, beautifully designed application. The platform features sophisticated AI-driven recommendations that learn from your listening habits to create personalized daily mixes, discover weekly playlists, and suggest new artists tailored specifically to your taste. Enjoy seamless cross-device synchronization that allows you to start listening on your phone and continue on your desktop, smart speaker, or gaming console without missing a beat. \n\nPremium subscribers unlock enhanced features including unlimited skips, extreme quality audio streaming at 320 kbps, offline downloading for travel, and ad-free listening. With collaborative playlists, social sharing capabilities, real-time lyrics display, and integration with popular smart home devices, Spotify creates the ultimate ecosystem for music discovery and entertainment.",
    "size": 92,
    "reviews": 1284500,
    "ratingAvg": 4.8,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 28500 },
      { "name": "2 star", "count": 32100 },
      { "name": "3 star", "count": 85600 },
      { "name": "4 star", "count": 245800 },
      { "name": "5 star", "count": 874500 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/yZsmiNjmji3ZoOuLthoVvptLB9cZ0vCmitcky4OUXNcEFV3IEQkrBD2uu5kuWRF5_ERA",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications",
    "id": 3,
    "description": "Zoom Cloud Meetings has become the global standard for video communication, offering enterprise-grade video conferencing capabilities to users worldwide. The application supports meetings with up to 1000 participants and view-only webinars for up to 10,000 attendees, making it suitable for everything from intimate team check-ins to massive corporate events. Features include crystal-clear HD video and audio, sophisticated virtual backgrounds with green screen support, comprehensive screen sharing with annotation tools, and robust recording capabilities with cloud storage options. \n\nAdvanced security features provide end-to-end encryption, waiting room management, passcode protection, and host controls to ensure secure meetings. The platform integrates seamlessly with popular calendar systems, offers breakout rooms for collaborative sessions, provides live transcription services, and supports real-time polling and Q&A sessions to enhance engagement during presentations and educational sessions.",
    "size": 215,
    "reviews": 892300,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 45200 },
      { "name": "2 star", "count": 38900 },
      { "name": "3 star", "count": 125600 },
      { "name": "4 star", "count": 245800 },
      { "name": "5 star", "count": 436800 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/vaxxIC1qaXOd1q1hmL7c66N-Mp4LXuQIuBZGM0dPIbwmyWcJAXbhIIZ8hNBWvar54c_j",
    "title": "Notion - notes, docs, tasks",
    "companyName": "Notion Labs, Inc.",
    "id": 4,
    "description": "Notion represents the future of workspace applications by combining notes, documents, databases, task management, and collaboration tools into one unified, incredibly versatile platform. This all-in-one workspace enables users to create custom databases with multiple view types including tables, kanban boards, calendars, galleries, and lists that can be interconnected through relational database properties. The application features a powerful block-based editor that supports rich media embedding, code syntax highlighting, mathematical equations, and over 50 content types. \n\nTeams can implement sophisticated workflow systems with customizable templates, automate repetitive tasks through built-in automation features, and maintain comprehensive project timelines with dependencies and milestones. With real-time collaboration, detailed version history, granular permission controls, and seamless cross-platform synchronization, Notion adapts to your unique workflow whether you're managing personal tasks, coordinating team projects, or building entire company knowledge bases.",
    "size": 78,
    "reviews": 156200,
    "ratingAvg": 4.7,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 3200 },
      { "name": "2 star", "count": 4500 },
      { "name": "3 star", "count": 12800 },
      { "name": "4 star", "count": 42500 },
      { "name": "5 star", "count": 93200 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/tw_coGKgk1K_zO-Ypf9zBKV1s-KT3dYN1MIUxIqtnbfmON5x_YmuoAr31gE4oSfJHNtA-aStTd-qe9R8S6NVyA",
    "title": "Duolingo - Language Lessons",
    "companyName": "Duolingo",
    "id": 5,
    "description": "Duolingo transforms language learning into an engaging, game-like experience that makes acquiring new language skills both fun and effective. The platform offers comprehensive courses in over 40 languages ranging from widely spoken languages like Spanish, French, and Chinese to endangered and constructed languages. Each course is meticulously designed by language experts and incorporates speaking, listening, reading, and writing exercises that adapt to your individual learning pace and style. \n\nThe app employs spaced repetition algorithms to optimize vocabulary retention, provides immediate feedback on pronunciation using advanced speech recognition technology, and offers detailed grammar explanations through interactive tips. With features like daily streaks to maintain motivation, leaderboards for friendly competition, story-based conversations for practical application, and personalized practice sessions to reinforce weak areas, Duolingo creates a structured yet flexible learning path suitable for complete beginners to advanced learners seeking to maintain their language proficiency.",
    "size": 45,
    "reviews": 985600,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 28500 },
      { "name": "2 star", "count": 32500 },
      { "name": "3 star", "count": 125600 },
      { "name": "4 star", "count": 285400 },
      { "name": "5 star", "count": 513600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/S76GphUu2pZa249td2Bb4XAhLcPRrFdL1zp_5qU1ouukvRq9r0-8jJ-CruaTtdT6g84",
    "title": "Calm - Sleep & Meditation",
    "companyName": "Calm.com",
    "id": 6,
    "description": "Calm stands as the world's leading mental wellness platform, offering an extensive library of resources designed to reduce anxiety, improve sleep quality, and enhance overall emotional wellbeing. The application features hundreds of guided meditations ranging from beginner-friendly 3-minute sessions to advanced 30-minute practices, all led by world-renowned mindfulness experts and therapists. \n\nThe sleep section includes an unparalleled collection of sleep stories narrated by celebrity voices, specially composed ambient soundscapes, and bedtime readings to help users fall asleep faster and enjoy more restful nights. Calm also provides daily calm sessions to establish consistent practice, masterclasses on specific wellness topics, breathing exercises for immediate anxiety relief, and gentle movement sessions for mindful physical activity. With personalized recommendations, progress tracking, and content for specific needs like stress management, focus improvement, and relationship enhancement, Calm serves as a comprehensive digital sanctuary for mental health maintenance and personal growth.",
    "size": 156,
    "reviews": 342100,
    "ratingAvg": 4.8,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 8500 },
      { "name": "2 star", "count": 9200 },
      { "name": "3 star", "count": 28500 },
      { "name": "4 star", "count": 85600 },
      { "name": "5 star", "count": 209300 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/3aWGqSf3T_p3F6wc8FFvcZcnjWlxpZdNaqFVEvPwQ1gTOPkVoZwq6cYvfK9eCkwCXbRY",
    "title": "Canva: Design & Graphics",
    "companyName": "Canva",
    "id": 7,
    "description": "Canva democratizes graphic design by providing an intuitive, drag-and-drop platform that enables anyone to create professional-quality visual content regardless of design experience. The application offers access to over 100 million premium stock photographs, illustrations, and design elements, plus thousands of professionally designed templates for social media graphics, presentations, posters, documents, and marketing materials. Advanced features include a comprehensive photo editor with background removal capabilities, an extensive typography library with hundreds of fonts, sophisticated animation tools for creating engaging video content, and brand kit functionality to maintain consistent branding across all designs. \n\nThe collaborative workspace allows real-time team editing, comment threads for feedback, and streamlined approval workflows. With seamless integration to social media platforms, cloud storage services, and printing facilities, Canva serves as an end-to-end design solution for individuals, educators, small businesses, and enterprise marketing teams seeking to create stunning visual communications efficiently.",
    "size": 112,
    "reviews": 456300,
    "ratingAvg": 4.6,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 12500 },
      { "name": "2 star", "count": 15800 },
      { "name": "3 star", "count": 45600 },
      { "name": "4 star", "count": 125800 },
      { "name": "5 star", "count": 256600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/XZCX4gp02jZVU53UO8j_tkc3u_i5kb3hlsUknNNCDRe1CZWuKV2f_7KWHqaqxbsSXuDa=w240-h480-rw",
    "title": "Headspace: Mindful Meditation",
    "companyName": "Headspace Inc.",
    "id": 8,
    "description": "Headspace provides a science-backed approach to meditation and mindfulness, offering structured courses and single sessions designed to build mental resilience and improve overall quality of life. The application features hundreds of guided meditations organized into progressive courses focusing on stress reduction, focus enhancement, anxiety management, sleep improvement, and physical health. Each meditation is carefully crafted by world-class meditation teachers and therapists, incorporating evidence-based techniques from mindfulness-based stress reduction and cognitive behavioral therapy. \n\nThe platform includes specialized sleep content with sleepcasts, wind-down exercises, and nighttime SOS sessions for moments of restlessness. Headspace also offers focused modes for specific activities like commuting, work breaks, and study sessions, plus mini-meditations for busy schedules. With detailed progress tracking, personalized recommendations, and educational animations explaining meditation concepts, Headspace makes mindfulness practice accessible and sustainable for beginners while providing depth and variety for experienced practitioners seeking to deepen their practice.",
    "size": 89,
    "reviews": 234500,
    "ratingAvg": 4.4,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 12500 },
      { "name": "2 star", "count": 15800 },
      { "name": "3 star", "count": 45600 },
      { "name": "4 star", "count": 75800 },
      { "name": "5 star", "count": 84700 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/bYtqbOcTYOlgc6gqZ2rwb8lptHuwlNE75zYJu6Bn076-hTmvd96HH-6v7S0YUAAJXoJN",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp Inc.",
    "id": 9,
    "description": "WhatsApp is a free-to-use messaging and voice over IP service that allows users to send text messages, voice messages, make voice and video calls, share images, documents, user locations, and other media. The application uses end-to-end encryption to ensure that only you and the person you're communicating with can read what's sent, and nobody in between, not even WhatsApp. \n\nWith features like group chats for up to 256 participants, disappearing messages that vanish after 7 days, status updates that disappear after 24 hours, and WhatsApp Web for desktop synchronization, the app provides comprehensive communication solutions. Additional features include broadcast lists for sending messages to multiple contacts simultaneously, starred messages for easy retrieval, and backup options to Google Drive for preserving your chat history across devices.",
    "size": 45,
    "reviews": 12500000,
    "ratingAvg": 4.2,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 450000 },
      { "name": "2 star", "count": 620000 },
      { "name": "3 star", "count": 1850000 },
      { "name": "4 star", "count": 3850000 },
      { "name": "5 star", "count": 6120000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/VRMWkE5p3CkWhJs6nv-9ZsLAs1QOg5ob1_3qg-rckwYW7yp1fMrYZqnEFpk0IoVP4LM",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 10,
    "description": "Instagram is a comprehensive social media platform that enables users to share photos and videos, connect with friends and interests, and discover content from around the world. The app features multiple content formats including Feed posts for permanent sharing, Stories that disappear after 24 hours, Reels for short-form video entertainment, and IGTV for longer video content. Advanced editing tools allow users to enhance their photos with filters, adjust brightness and contrast, and create collages. \n\nThe platform supports direct messaging, group conversations, and interactive features like polls and questions in Stories. Business accounts provide analytics, shopping features, and promotional tools. With algorithmic feeds personalized to user interests, explore pages for content discovery, and robust privacy controls, Instagram serves as both a creative outlet and social connection platform for over a billion users worldwide.",
    "size": 85,
    "reviews": 9850000,
    "ratingAvg": 4.1,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 520000 },
      { "name": "2 star", "count": 780000 },
      { "name": "3 star", "count": 1980000 },
      { "name": "4 star", "count": 3250000 },
      { "name": "5 star", "count": 4320000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/384jx3OL4_tqtCGZrfIB6Q5TehM0Q7TLYFsenRPfeT8f-3vicWH2BYbvaEAneaPFMMM",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 11,
    "description": "Netflix is the world's leading streaming entertainment service with over 200 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. The platform offers personalized recommendations based on viewing history, allows multiple user profiles within a single account, and supports downloading for offline viewing. \n\nMembers can watch as much as they want, anytime, anywhere, on any internet-connected screen without commercials or commitments. Netflix Originals include award-winning series like Stranger Things, The Crown, and Bridgerton, plus critically acclaimed films and documentaries. The service continuously updates its library with new content weekly and offers multiple streaming quality options including HD and Ultra HD 4K with HDR. Parental controls, kids profiles, and sophisticated search functionality make it easy to find content suitable for all ages and interests.",
    "size": 78,
    "reviews": 4562000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 1258000 },
      { "name": "5 star", "count": 2435000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/9kABykeGovHPy-dN19lRxxnCp8IZK3Pkl8qLFNxrEe-hhKVZeiyhTBEIRUt6t-vhxQ",
    "title": "Microsoft Word",
    "companyName": "Microsoft Corporation",
    "id": 12,
    "description": "Microsoft Word is the world's most powerful and popular document creation application, providing comprehensive word processing capabilities on mobile devices. The app enables users to create, edit, and share documents with advanced formatting options, templates, and collaboration features. Key functionalities include real-time co-authoring where multiple people can work on documents simultaneously, advanced reviewing tools with track changes and comments, and seamless integration with OneDrive for automatic saving and version history. \n\nThe mobile version offers a streamlined interface with focus mode for distraction-free writing, dictation capabilities for voice-to-text conversion, and PDF editing tools. With support for various file formats including DOCX, PDF, and ODT, plus integration with other Microsoft Office applications, Word provides enterprise-grade document management for students, professionals, and organizations of all sizes.",
    "size": 245,
    "reviews": 1256000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 45000 },
      { "name": "2 star", "count": 62000 },
      { "name": "3 star", "count": 185000 },
      { "name": "4 star", "count": 385000 },
      { "name": "5 star", "count": 578000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Ke-5JLK-HHb01QKFZ4u4y4d3e_9li_o2ZJ84GCd1vqrPQ_UQfZWV2cNUKSH7BJklkBk",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Google Maps is the most comprehensive and accurate navigation application available, offering detailed maps, real-time GPS navigation, traffic conditions, and public transportation information for over 220 countries and territories. The app provides turn-by-turn voice guidance for driving, walking, and cycling routes, with estimated arrival times based on live traffic data. Features include Street View for exploring locations visually, indoor maps for airports, malls and stadiums, and offline maps for areas with poor internet connectivity. \n\nBusiness listings include hours, photos, reviews and contact information, while integrated booking features allow reservations at restaurants and events. With real-time location sharing, saved places, and personalized recommendations based on search history, Google Maps serves as an indispensable tool for daily commuting, travel planning, and local business discovery.",
    "size": 125,
    "reviews": 8560000,
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 285000 },
      { "name": "2 star", "count": 456000 },
      { "name": "3 star", "count": 1256000 },
      { "name": "4 star", "count": 2854000 },
      { "name": "5 star", "count": 3709000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/BmUViDVOKNJe0GYJe22hsr7juFndRVbvr1fGmHGXqHfJjNAXjd26bfuGRQpVrpJ6YbA",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 14,
    "description": "TikTok is the leading destination for short-form mobile video entertainment, offering an endless stream of personalized content ranging from 15 seconds to 10 minutes. The platform's sophisticated algorithm learns user preferences to serve relevant videos across diverse categories including comedy, education, dance, cooking, and lifestyle. Creative tools include extensive filters and effects, green screen capabilities, voice effects, and a massive library of trending sounds and music. \n\nThe app supports duets and stitches for collaborative content creation, live streaming for real-time interaction with creators, and Q&A features for audience engagement. TikTok Shop integrates e-commerce directly into the platform, while Creator Tools provide analytics and monetization options. With robust privacy controls, family pairing for teen safety, and content preferences for customizing the viewing experience, TikTok has revolutionized mobile entertainment and content creation.",
    "size": 215,
    "reviews": 7450000,
    "ratingAvg": 4.2,
    "downloads": 2000000000,
    "ratings": [
      { "name": "1 star", "count": 425000 },
      { "name": "2 star", "count": 589000 },
      { "name": "3 star", "count": 1456000 },
      { "name": "4 star", "count": 2258000 },
      { "name": "5 star", "count": 2722000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/WTGDz8M2gRie-UPC1eFZ321-RavuXFhKlcvxHp0uVEDN0UrWfCMwU9uMvuEE98H3VtZG",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "id": 15,
    "description": "Uber revolutionized personal transportation by connecting riders with drivers through a sophisticated mobile platform that provides reliable rides in minutes. The app offers multiple service options including UberX for everyday rides, Uber Comfort for newer cars with extra legroom, Uber Black for premium luxury vehicles, and Uber Pool for cost-effective shared rides. Advanced features include upfront pricing before booking, scheduled rides for future trips, split fare options for group travel, and real-time GPS tracking of your driver's location. \n\nThe integrated payment system supports credit cards, PayPal, and Uber Cash with automatic receipts. Safety features include driver background checks, 24/7 support, share trip status with trusted contacts, and emergency assistance button. With additional services like Uber Eats for food delivery and Uber Freight for shipping, the platform has expanded beyond transportation to become a comprehensive logistics solution.",
    "size": 145,
    "reviews": 3250000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 958000 },
      { "name": "5 star", "count": 1522000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/1Ns1T_qN0pEXMvZeZ5lQNAR8z4blP7ce2J2Nn5doXvt2T1g_W7VMORdWHaApkOooupI",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 16,
    "description": "Amazon Shopping provides access to the world's largest online marketplace with millions of products across hundreds of categories available for purchase with fast, reliable delivery. The app features personalized recommendations based on browsing and purchase history, visual search using the camera to find products, and augmented reality view to see how items would look in your space. Key functionalities include one-click ordering, order tracking with real-time updates, easy returns management, and secure payment options including Amazon Pay. \n\nPrime members enjoy additional benefits like free same-day and one-day delivery, Prime Video streaming, and exclusive deals during Prime Day events. The app also supports Alexa integration for voice shopping, subscription management for recurring purchases, and wish list sharing for gift occasions. With robust seller ratings, customer reviews, and comparison tools, Amazon Shopping delivers a comprehensive retail experience.",
    "size": 95,
    "reviews": 8560000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 385000 },
      { "name": "2 star", "count": 489000 },
      { "name": "3 star", "count": 1256000 },
      { "name": "4 star", "count": 2854000 },
      { "name": "5 star", "count": 3576000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6am0i3walYwNLc08QOOhRJttQENNGkhlKajXSERf3JnPVRQczIyxw2w3DxeMRTOSdsY",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 17,
    "description": "YouTube is the world's largest video platform with over 2 billion logged-in monthly users watching over a billion hours of video daily. The app provides access to an immense library of content including music videos, educational tutorials, product reviews, vlogs, documentaries, and original series. Features include personalized recommendations based on watch history, creating and managing playlists, downloading videos for offline viewing, and casting to TV devices. \n\nYouTube Premium offers ad-free viewing, background play, and access to YouTube Music. Content creators can upload, edit, and manage their channels with sophisticated analytics and monetization tools. The platform supports multiple video quality options up to 4K, live streaming capabilities, and interactive features like polls and chapters. With robust parental controls through YouTube Kids and learning resources through YouTube EDU, the service caters to diverse audiences and use cases.",
    "size": 185,
    "reviews": 12500000,
    "ratingAvg": 4.2,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 625000 },
      { "name": "2 star", "count": 889000 },
      { "name": "3 star", "count": 2256000 },
      { "name": "4 star", "count": 3854000 },
      { "name": "5 star", "count": 4886000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/pmEnTOeRvosC1yOXFVwo15zS2uAdB9nijugU93NbrmFBYt61IVCZBzg7EZ00YTqmLw",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 18,
    "description": "Google Photos is a sophisticated photo and video storage service that automatically backs up your media to the cloud, making them accessible from any device while saving space on your phone. The app uses advanced machine learning to organize your photos by people, places, and things, enabling powerful search capabilities like finding photos by describing their content. Creative features include automatic albums and movies, photo books printing service, and editing tools for enhancements and filters. \n\nShared albums allow collaborative photo collections with friends and family, while partner sharing automatically sends photos of specific people to another account. The service offers 15GB of free storage with affordable upgrade options, maintains high-quality compression to preserve visual quality while reducing file sizes, and provides robust privacy controls with options to archive or completely delete sensitive content.",
    "size": 95,
    "reviews": 4562000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 1258000 },
      { "name": "5 star", "count": 2435000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/jKU64njy8urP89V1O63eJxMtvWjDGETPlHVIhDv9WZAYzsSxRWyWZkUlBJZj_HbkHA",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 19,
    "description": "Microsoft Teams is a comprehensive collaboration platform that combines workplace chat, video meetings, file storage, and application integration in a single interface. The application supports teams of all sizes with channels for organized conversations, file sharing with co-authoring capabilities, and calendar integration for scheduling meetings. Video conferencing features include together mode that places participants in a shared background, background blur and custom backgrounds, live captions, and large gallery view for up to 49 participants. \n\nThe mobile app provides full functionality including presenting documents, participating in whiteboard sessions, and accessing shared files from OneDrive and SharePoint. With integration to the entire Microsoft 365 ecosystem including Word, Excel, and PowerPoint, plus thousands of third-party apps through the Teams store, the platform serves as a digital hub for modern hybrid work environments.",
    "size": 285,
    "reviews": 1256000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 85000 },
      { "name": "2 star", "count": 112000 },
      { "name": "3 star", "count": 256000 },
      { "name": "4 star", "count": 485000 },
      { "name": "5 star", "count": 418000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/kMofEFLjobZy_bCuaiDogzBcUT-dz3BBbOrIEjJ-hqOabjK8ieuevGe6wlTD15QzOqw",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 20,
    "description": "LinkedIn is the world's largest professional network with over 800 million members, providing a platform to connect with colleagues, discover career opportunities, and access business insights. The app enables users to build and maintain professional profiles that serve as digital resumes, connect with industry peers, and join groups relevant to their interests. Job search functionality includes personalized recommendations, easy application processes, and salary insights. The feed delivers professional content, industry news, and thought leadership articles tailored to user interests. Learning features provide access to thousands of courses covering business, technology, and creative skills. \n\nMessaging capabilities facilitate professional communication, while company pages offer insights into organizational culture and hiring practices. With features like LinkedIn Premium for enhanced visibility and recruiting tools, the platform serves job seekers, entrepreneurs, sales professionals, and established enterprises alike.",
    "size": 125,
    "reviews": 2563000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 858000 },
      { "name": "5 star", "count": 935000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/t-juVwXA8lDAk8uQ2L6d6K83jpgQoqmK1icB_l9yvhIAQ2QT_1XbRwg5IpY08906qEw",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 21,
    "description": "Google Drive is a comprehensive cloud storage and file synchronization service that provides a secure way to store, access, and share files from any mobile device, tablet, or computer. The platform offers 15GB of free storage shared across Google services with affordable upgrade options up to 30TB. Files stored in Drive are protected by advanced security measures including two-factor authentication and encryption in transit and at rest. The mobile app enables quick document scanning using the camera, offline access to important files, and automatic backup of photos and videos. \n\nIntegration with Google Workspace allows seamless editing of Docs, Sheets, and Slides directly within the app. Advanced sharing controls include link sharing with customizable permissions, expiration dates for access, and download restrictions. With powerful search capabilities that can find text within images and PDFs, plus activity tracking for file changes, Google Drive serves as a reliable central hub for personal and professional file management.",
    "size": 85,
    "reviews": 4562000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 185000 },
      { "name": "2 star", "count": 289000 },
      { "name": "3 star", "count": 656000 },
      { "name": "4 star", "count": 1558000 },
      { "name": "5 star", "count": 1877000 }
    ]
  },
  {
    "image": "https://store-images.s-microsoft.com/image/apps.45406.9007199266244427.4d45042b-d7a5-4a83-be66-97779553b24d.2a88a418-b96d-44a6-ad4f-5e0ee6289b2c",
    "title": "Twitter",
    "companyName": "Twitter, Inc.",
    "id": 22,
    "description": "Twitter is a real-time social networking platform that enables users to share and discover what's happening in the world through short messages called tweets. The service supports tweets up to 280 characters, along with photos, videos, and links to external content. The timeline displays tweets from accounts you follow, while trending topics and curated moments highlight breaking news and popular conversations. Features include direct messaging for private conversations, lists for organizing accounts into categories, and bookmarking for saving tweets to read later. \n\nAdvanced tweet tools include polls for gathering opinions, threaded tweets for longer thoughts, and scheduled tweets for optimal timing. The platform serves journalists, celebrities, politicians, and everyday users for sharing updates, participating in discussions, and staying informed about current events. With customizable notification settings, content preferences, and safety tools for managing interactions, Twitter facilitates public conversation at global scale.",
    "size": 95,
    "reviews": 4562000,
    "ratingAvg": 4.0,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 485000 },
      { "name": "2 star", "count": 689000 },
      { "name": "3 star", "count": 1256000 },
      { "name": "4 star", "count": 1258000 },
      { "name": "5 star", "count": 875000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6CFQQ0b9r5fzF1v6f0gIirWsOGL7sGWkJifuUQxxhbCMcBx5aSG_cNXpjDKDn5c1jwjq",
    "title": "Pinterest",
    "companyName": "Pinterest",
    "id": 23,
    "description": "Pinterest is a visual discovery engine that helps users find ideas for their interests and passions, from recipes and home decor to fashion and travel destinations. The platform organizes content into thematic boards that users can create and curate, with pins that link back to original sources. Visual search technology allows users to take photos of things they like and find similar items or ideas. The home feed displays personalized recommendations based on saved pins and search history, while trending topics highlight popular ideas. \n\nShopping features include product pins with pricing and availability, and catalogs that help users discover purchasable items. The app also offers AR try-on for home decor and beauty products, step-by-step guides for DIY projects, and idea recommendations for specific events like weddings or parties. With tools for planning projects, organizing inspiration, and discovering new interests, Pinterest serves as a creative toolkit for personal and professional projects.",
    "size": 75,
    "reviews": 2563000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 858000 },
      { "name": "5 star", "count": 935000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/mwTU9-4NX-_QlATb6lILSinKI47wAtOM38GjPYRPQSsQOG2hVRY4h9OfEhDxpf8ADQ=w240-h480-rw",
    "title": "Shazam",
    "companyName": "Apple Inc.",
    "id": 24,
    "description": "Shazam is a revolutionary music identification service that can recognize songs playing in your environment within seconds. The app uses advanced audio fingerprinting technology to match audio samples against a massive database of millions of tracks. Beyond simple identification, Shazam provides detailed information about recognized songs including artist biographies, lyrics in real-time synchronization with the music, music videos, and links to streaming services like Apple Music and Spotify. The Auto Shazam feature continuously listens for music in the background, while pop-up Shazam allows identification from any screen. \n\nDiscovery features include personalized recommendations based on your Shazam history, curated charts of trending songs globally and by region, and music news from your favorite artists. The app also identifies television shows and advertisements, making it a comprehensive media discovery tool that has identified over 50 billion songs since its inception.",
    "size": 45,
    "reviews": 1256000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 45000 },
      { "name": "2 star", "count": 62000 },
      { "name": "3 star", "count": 125000 },
      { "name": "4 star", "count": 285000 },
      { "name": "5 star", "count": 739000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ZrNeuKthBirZN7rrXPN1JmUbaG8ICy3kZSHt-WgSnREsJzo2txzCzjIoChlevMIQEA",
    "title": "Google Translate",
    "companyName": "Google LLC",
    "id": 25,
    "description": "Google Translate breaks down language barriers by providing instant translation between 108 languages through various input methods. The app supports text translation by typing or pasting content, camera translation that converts text within images in real-time, conversation mode for bilingual spoken translations, and handwriting recognition for character-based languages. The camera feature can translate signs, menus, and documents instantly, while the conversation mode facilitates smooth bilingual discussions. The app also supports offline translation for 59 languages, allowing functionality without internet connectivity. \n\nAdditional features include phrasebook for saving common translations, tap to translate that works within other apps, and website translation for browsing foreign language content. With neural machine translation technology that continuously improves accuracy, and support for regional dialects and linguistic nuances, Google Translate serves travelers, students, business professionals, and anyone needing cross-language communication.",
    "size": 65,
    "reviews": 4562000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 1258000 },
      { "name": "5 star", "count": 2435000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/r7XL36PVNtnidqy6ikRiW1AHEIsjhePrZ8W5M4cNTQy5ViF3-lIDY47hpvxc84kJ7lw",
    "title": "Waze Navigation & Live Traffic",
    "companyName": "Waze",
    "id": 26,
    "description": "Waze is a community-driven navigation app that provides real-time traffic information, road alerts, and optimal routing based on input from millions of drivers. The platform uses crowd-sourced data to display accidents, police presence, traffic jams, road closures, and fuel prices along your route. Social features allow drivers to connect with friends, coordinate meetups, and see when others will arrive at common destinations. \n\nThe app learns your frequent destinations and preferred routes, offering personalized departure time suggestions based on typical traffic patterns. Voice-guided navigation includes celebrity voice options, while integration with music streaming services allows control without leaving the app. Carpool features help coordinate ridesharing, and business integrations show promotions along your route. With constantly updated maps through community editing tools and real-time rerouting to avoid delays, Waze turns everyday commuting into a collaborative experience that saves time and reduces frustration.",
    "size": 135,
    "reviews": 2563000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 85000 },
      { "name": "2 star", "count": 112000 },
      { "name": "3 star", "count": 256000 },
      { "name": "4 star", "count": 858000 },
      { "name": "5 star", "count": 1239000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/xOKbvDt362x1uzW-nnggP-PgO9HM4L1vwBl5HgHFHy_n1X3mqeBtOSoIyNJzTS3rrj70",
    "title": "PayPal",
    "companyName": "PayPal Mobile",
    "id": 27,
    "description": "PayPal provides a secure digital payment platform that enables individuals and businesses to send and receive money, make online purchases, and manage financial transactions globally. The app supports peer-to-peer payments using email addresses or phone numbers, splitting bills with friends, and requesting money from contacts. Business features include invoicing tools, payment tracking, and integration with e-commerce platforms. \n\nSecurity measures include purchase protection for eligible transactions, encryption for all financial data, and two-factor authentication. The app supports multiple funding sources including bank accounts, credit cards, and the PayPal balance, with instant transfer options to linked accounts. Additional services include PayPal Credit for financing larger purchases, cryptocurrency buying and selling, and donation features for charitable giving. With widespread merchant acceptance and support for 25 currencies across 200 markets, PayPal serves as a comprehensive financial tool for personal and commercial use.",
    "size": 95,
    "reviews": 1256000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 256000 },
      { "name": "4 star", "count": 385000 },
      { "name": "5 star", "count": 301000 }
    ]
  },
  {
    "image": "https://telegrafi.com/media-library/2024-06-screenshot-21-png.png?id=58291468&width=1200&height=1200&coordinates=147%2C0%2C148%2C0",
    "title": "Google Calendar",
    "companyName": "Google LLC",
    "id": 28,
    "description": "Google Calendar is a sophisticated time-management and scheduling application that helps individuals and teams organize their schedules, coordinate meetings, and never miss important events. The app displays multiple calendar views including day, week, month, and agenda, with color-coding for different calendar types. Smart scheduling features suggest optimal meeting times based on attendees' availability, while Find a Time automatically identifies overlapping free slots. \n\nThe Goals feature helps schedule time for personal objectives like exercise or learning, automatically adjusting when conflicts arise. Integration with Gmail automatically adds events from flight confirmations, hotel bookings, and concert tickets. Work features include shared calendars for teams, room and resource booking, and working hours designation. Customizable notifications provide reminders via email, mobile push, or desktop alerts, with options for multiple reminder types. With offline access, search across all events, and attachment support for relevant documents, Google Calendar serves as a central hub for personal and professional time management.",
    "size": 55,
    "reviews": 4562000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 189000 },
      { "name": "3 star", "count": 456000 },
      { "name": "4 star", "count": 1558000 },
      { "name": "5 star", "count": 2135000 }
    ]
  }
]
